############################################
# GOLDEN DESIGN
############################################
[gold]
read_verilog -sv -formal <ORIGINAL_FILE>

############################################
# UPDATED / GATE DESIGN
############################################
[gate]
read_verilog -sv -formal <MODIFIED_FILE>

[script]
#chparam -set ...
#prep -top <MODULE_NAME> -flatten
hierarchy -top <MODULE_NAME> -check
flatten
proc -ifx
#splitnets -ports
clean
setundef -anyseq
#sim -w -clock clk -reset reset -rstlen 10 -n 10


############################################
# MATCHING / PARTITIONING HINTS
############################################
# The below section should be formatted as:
# [match <MODULE_NAME>]
# gold-match <gold_signal> <gate_signal>
# ...
# And should be followed by a blank line, marking the end of the section.
# Gate names may use TL-Verilog pipesignal references, which will be mapped by `fev.sh`.
[match <MODULE_NAME>]

[collect *]
# Let EQY partition automatically.
# If you want to force grouping by register name patterns, you can uncomment:
# group *

[partition *]
# It can be useful to group outputs to avoid output cut points if outputs are used internally.
#name outputs ^o_.*


############################################
# STRATEGIES
############################################
# Disabled due to https://github.com/YosysHQ/eqy/issues/83
#[strategy fast_sat]
#use sat
#depth 10

[strategy sby_seq]
use sby
depth 20
engine smtbmc
